Repository: 1000heads-luke/shlink
Catalog: module/Rest/lang/*.po
Languages: es

source: You have to provide a valid API key under the "apiKey" param name.
es: Debes proporcionar una clave de API válida bajo el nombre de parámetro "apiKey".

source: Provided API key does not exist or is invalid.
es: La clave de API proporcionada no existe o es inválida.

source: A URL was not provided
es: No se ha proporcionado una URL

source: Provided URL %s is invalid. Try with a different one.
es: La URL proporcionada "%s" es inválida. Prueba con una diferente.

source: Unexpected error occurred
es: Ocurrió un error inesperado

source: A list of tags was not provided
es: No se ha proporcionado una lista de etiquetas

source: No URL found for short code "%s"
es: No se ha encontrado ninguna URL para el código corto "%s"

source: Provided short code %s does not exist
es: El código corto "%s" proporcionado no existe

source: Provided short code "%s" has an invalid format
es: El código corto proporcionado "%s" tiene un formato no inválido

source: You have to provide both 'oldName' and 'newName' params in order to properly rename the tag
es: Debes proporcionar tanto el parámetro 'oldName' como 'newName' para poder renombrar la etiqueta correctamente

source: It wasn't possible to find a tag with name '%s'
es: No fue posible encontrar una etiqueta con el nombre '%s'

source: You need to provide the Bearer type in the %s header.
es: Debes proporcionar el typo Bearer en la cabecera %s.

source: Provided authorization type %s is not supported. Use Bearer instead.
es: El tipo de autorización proporcionado %s no está soportado. En vez de eso utiliza Bearer.

source: Missing or invalid auth token provided. Perform a new authentication request and send provided token on every new request on the "%s" header
es: No se ha proporcionado token de autenticación o este es inválido. Realiza una nueva petición de autenticación y envía el token proporcionado en cada nueva petición en la cabecera "%s"
