Repository: 1000heads-luke/shlink
Catalog: module/CLI/lang/*.po
Languages: es

source: Disables an API key.
es: Desahbilita una clave de API.

source: The API key to disable
es: La clave de API a deshabilitar

source: API key "%s" properly disabled
es: Clave de API "%s" deshabilitada correctamente

source: API key "%s" does not exist.
es: La clave de API "%s" no existe.

source: Generates a new valid API key.
es: Genera una nueva clave de API válida.

source: The date in which the API key should expire. Use any valid PHP format.
es: La fecha en la que la clave de API debe expirar. Utiliza cualquier valor válido en PHP.

source: Generated API key: "%s"
es: Generada clave de API. "%s"

source: Lists all the available API keys.
es: Lista todas las claves de API disponibles.

source: Tells if only enabled API keys should be returned.
es: Define si sólo las claves de API habilitadas deben ser devueltas.

source: Key
es: Clave

source: Is enabled
es: Está habilitada

source: Expiration date
es: Fecha de caducidad

source: Generates a character set sample just by shuffling the default one, "%s". Then it can be set in the SHORTCODE_CHARS environment variable
es: Genera un grupo de caracteres simplemente mexclando el grupo por defecto "%s". Después puede ser utilizado en la variable de entrono SHORTCODE_CHARS

source: Character set: "%s"
es: Grupo de caracteres: "%s"

source: Generates a random secret string that can be used for JWT token encryption
es: Genera una cadena de caracteres aleatoria que puede ser usada para cifrar tokens JWT

source: Secret key: "%s"
es: Clave secreta: "%s"

source: Processes and generates the previews for every URL, improving performance for later web requests.
es: Procesa y genera las vistas previas para cada URL, mejorando el rendimiento para peticiones web posteriores.

source: Finished processing all URLs
es: Finalizado el procesado de todas las URLs

source: Processing URL %s...
es: Procesando URL %s...

source: <info>Success!</info>
es: <info>¡Correcto!</info>

source: Generates a short code for provided URL and returns the short URL
es: Genera un código corto para la URL proporcionada y devuelve la URL acortada

source: The long URL to parse
es: La URL larga a procesar

source: Tags to apply to the new short URL
es: Etiquetas a aplicar a la nueva URL acortada

source: The date from which this short URL will be valid. If someone tries to access it before this date, it will not be found.
es: La fecha desde la cual será válida esta URL acortada. Si alguien intenta acceder a ella antes de esta fecha, no será encontrada.

source: The date until which this short URL will be valid. If someone tries to access it after this date, it will not be found.
es: La fecha hasta la cual será válida está URL acortada. Si alguien intenta acceder a ella después de esta fecha, no será encontrada.

source: If provided, this slug will be used instead of generating a short code
es: Si se proporciona, este slug será usado en vez de generar un código corto

source: This will limit the number of visits for this short URL.
es: Esto limitará el número de visitas a esta URL acortada.

source: A URL was not provided!
es: ¡No se ha proporcionado una URL!

source: Processed long URL:
es: URL larga procesada:

source: Generated short URL:
es: URL corta generada:

source: Provided URL "%s" is invalid. Try with a different one.
es: La URL proporcionada "%s" e inválida. Prueba con una diferente.

source: Provided slug "%s" is already in use by another URL. Try with a different one.
es: El slug proporcionado "%s" ya está siendo usado para otra URL. Prueba con uno diferente.

source: Returns the detailed visits information for provided short code
es: Devuelve la información detallada de visitas para el código corto proporcionado

source: The short code which visits we want to get
es: El código corto del cual queremos obtener las visitas

source: Allows to filter visits, returning only those older than start date
es: Permite filtrar las visitas, devolviendo sólo aquellas más antiguas que startDate

source: Allows to filter visits, returning only those newer than end date
es: Permite filtrar las visitas, devolviendo sólo aquellas más nuevas que endDate

source: A short code was not provided. Which short code do you want to use?
es: No se proporcionó un código corto. ¿Qué código corto deseas usar?

source: Referer
es: Origen

source: Date
es: Fecha

source: Remote Address
es: Dirección remota

source: User agent
es: Agente de usuario

source: List all short URLs
es: Listar todas las URLs cortas

source: The first page to list (%s items per page)
es: La primera página a listar (%s elementos por página)

source: A query used to filter results by searching for it on the longUrl and shortCode fields
es: Una consulta usada para filtrar el resultado buscándola en los campos longUrl y shortCode

source: A comma-separated list of tags to filter results
es: Una lista de etiquetas separadas por coma para filtrar el resultado

source: The field from which we want to order by. Pass ASC or DESC separated by a comma
es: El campo por el cual queremos ordernar. Pasa ASC o DESC separado por una coma

source: Whether to display the tags or not
es: Si se desea mostrar las etiquetas o no

source: Short code
es: Código corto

source: Original URL
es: URL original

source: Date created
es: Fecha de creación

source: Visits count
es: Número de visitas

source: Tags
es: Etiquetas

source: Short codes properly listed
es: Códigos cortos correctamente listados

source: Continue with page
es: Continuar con la página

source: Returns the long URL behind a short code
es: Devuelve la URL larga detrás de un código corto

source: The short code to parse
es: El código corto a convertir

source: A short code was not provided. Which short code do you want to parse?
es: No se proporcionó un código corto. ¿Qué código corto quieres convertir?

source: Long URL:
es: URL larga:

source: Provided short code "%s" has an invalid format.
es: El código corto proporcionado "%s" tiene un formato inválido.

source: Provided short code "%s" could not be found.
es: El código corto proporcionado "%s" no ha podido ser encontrado.

source: Creates one or more tags.
es: Crea una o más etiquetas.

source: The name of the tags to create
es: El nombre de las etiquetas a crear

source: You have to provide at least one tag name
es: Debes proporcionar al menos un nombre de etiqueta

source: Tags properly created
es: Etiquetas correctamente creadas

source: Deletes one or more tags.
es: Elimina una o más etiquetas.

source: The name of the tags to delete
es: El nombre de las etiquetas a eliminar

source: Tags properly deleted
es: Etiquetas correctamente eliminadas

source: Lists existing tags.
es: Lista las etiquetas existentes.

source: No tags yet
es: Aún no hay etiquetas

source: Renames one existing tag.
es: Renombra una etiqueta existente.

source: Current name of the tag.
es: Nombre actual de la etiqueta.

source: New name of the tag.
es: Nuevo nombre de la etiqueta.

source: Tag properly renamed.
es: Etiqueta correctamente renombrada.

source: A tag with name "%s" was not found
es: Una etiqueta con nombre "%s" no ha sido encontrada

source: Processes visits where location is not set yet
es: Procesa las visitas donde la localización no ha sido establecida aún

source: Processing IP
es: Procesando IP

source: Ignored localhost address
es: Ignorada IP de localhost

source: Address located at "%s"
es: Dirección localizada en "%s"

source: An error occurred while locating IP
es: Se produjo un error al localizar la IP

source: IP location resolver limit reached. Waiting %s seconds...
es: Limite del localizador de IPs alcanzado. Esperando %s segundos...

source: Finished processing all IPs
es: Finalizado el procesado de todas las IPs
